app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "answers" ("is_correct", "content", "created_at", "updated_at", "question_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["is_correct", false], ["content", "2"], ["created_at", "2020-07-21 18:14:54.442083"], ["updated_at", "2020-07-21 18:14:54.442083"], ["question_id", 4]]
---
  def create
    @answer = Answer.new(answer_params)
    @question = Question.find(params[:question_id])
    @answer.question = @question

    if @answer.save