app/controllers/authentication_controller.rb

    def login
        @user = User.find_by(username: login_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "charaf"], ["LIMIT", 1]]