app/controllers/questions_controller.rb

  def create
    @quiz = Quiz.find(params[:quiz_id])

    @question = Question.new(question_params)
    @question.quiz = @quiz
    if @question.save
---
INSERT INTO "questions" ("question", "created_at", "updated_at", "quiz_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["question", "q"], ["created_at", "2020-07-21 18:08:36.292740"], ["updated_at", "2020-07-21 18:08:36.292740"], ["quiz_id", 29]]